Merge pull request #1 from foxdavidj/new-version
Complete rewrite
